html/apue/file_directory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>文件和目录</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="standard.html"> UP </a>
 |
 <a accesskey="H" href="apue.html"> HOME </a>
</div><div id="content">
<h1 class="title">文件和目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">stat、fstat和lstat函数</a>
<ul>
<li><a href="#sec-1-1">stat结构</a></li>
</ul>
</li>
<li><a href="#sec-2">文件类型</a>
<ul>
<li><a href="#sec-2-1">文件类型测试宏</a></li>
</ul>
</li>
<li><a href="#sec-3">文件权限</a>
<ul>
<li><a href="#sec-3-1">进程相关的用户和组ID</a></li>
<li><a href="#sec-3-2">设置-用户-ID和设置-组-ID</a></li>
<li><a href="#sec-3-3">文件存取许可权</a>
<ul>
<li><a href="#sec-3-3-1">存取权限规则</a></li>
<li><a href="#sec-3-3-2">存取权限测试</a></li>
<li><a href="#sec-3-3-3">新文件和目录的所有权</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
首先从stat函数开始逐个说明stat结构的每一个成员以了解文件的所有属性，然后将说明修改这些属性的各个函数(更改所有者,更改许可权等)，接着更详细地察看UNIX文件系统的结构以及符号连接，最后介绍对目录进行操作的各个函数并且开发了一个以降序遍历目录层次结构的函数
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">stat、fstat和lstat函数</h2>
<div class="outline-text-2" id="text-1">
<p>
获取一个文件的详细信息可以使用stat函数组：
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/types.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/stat.h&gt;</span>

<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#26681;&#25454;&#25991;&#20214;&#36335;&#24452;&#21517;&#33719;&#21462;&#25991;&#20214;&#30340;&#35814;&#32454;&#20449;&#24687;</span>

<span style="color: #ffa07a;">   pathname&#65306;&#25991;&#20214;&#36335;&#24452;&#21517;</span>
<span style="color: #ffa07a;">   buf&#65306;&#25351;&#21521;&#25991;&#20214;&#20449;&#24687;&#32467;&#26500;&#20307;stat&#21464;&#37327;&#30340;&#25351;&#38024;</span>

<span style="color: #ffa07a;">   &#36820;&#22238;&#65306;&#27491;&#30830;&#36820;&#22238;0&#65292;&#20986;&#38169;&#36820;&#22238;-1</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">stat</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">pathname</span>, <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">stat</span>* <span style="color: #eedd82;">buf</span>);

<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#26681;&#25454;&#25991;&#20214;&#25551;&#36848;&#31526;&#33719;&#21462;&#25991;&#20214;&#30340;&#35814;&#32454;&#20449;&#24687;</span>

<span style="color: #ffa07a;">   filedes&#65306;&#25991;&#20214;&#25551;&#36848;&#31526;&#21495;</span>
<span style="color: #ffa07a;">   buf&#65306;&#25351;&#21521;&#25991;&#20214;&#20449;&#24687;&#32467;&#26500;&#20307;stat&#21464;&#37327;&#30340;&#25351;&#38024;</span>

<span style="color: #ffa07a;">   &#36820;&#22238;&#65306;&#27491;&#30830;&#36820;&#22238;0&#65292;&#20986;&#38169;&#36820;&#22238;-1</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">fstat</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">filedes</span>, <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">stat</span>* <span style="color: #eedd82;">buf</span>);  


<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#36820;&#22238;&#38142;&#25509;&#25991;&#20214;&#30340;&#26377;&#20851;&#20449;&#24687;,&#32780;&#19981;&#26159;&#30001;&#35813;&#38142;&#25509;&#24341;&#29992;&#30340;&#25991;&#20214;&#30340;&#20449;&#24687;</span>

<span style="color: #ffa07a;">   pathname&#65306;&#25991;&#20214;&#36335;&#24452;&#21517;</span>
<span style="color: #ffa07a;">   buf&#65306;&#25351;&#21521;&#25991;&#20214;&#20449;&#24687;&#32467;&#26500;&#20307;stat&#21464;&#37327;&#30340;&#25351;&#38024;</span>

<span style="color: #ffa07a;">   &#36820;&#22238;&#65306;&#27491;&#30830;&#36820;&#22238;0&#65292;&#20986;&#38169;&#36820;&#22238;-1</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">lstat</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">pathname</span>, <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">stat</span>* <span style="color: #eedd82;">buf</span>);
</pre>
</div>
<p>
使用stat函数最多的可能是ls -l命令，用其可以获得有关一个文件的所有信息
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">stat结构</h3>
<div class="outline-text-3" id="text-1-1">
<p>
stat结构给出了Unix下文件(目录)各种属性的相关信息
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">stat</span>  
{  
    <span style="color: #98fb98;">mode_t</span> <span style="color: #eedd82;">st_mode</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#30340;&#31867;&#22411;&#21644;&#26435;&#38480;  </span>
    <span style="color: #98fb98;">ino_t</span> <span style="color: #eedd82;">st_ino</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">inode&#30340;&#33410;&#28857;&#21495;  </span>
    <span style="color: #98fb98;">dev_t</span> <span style="color: #eedd82;">st_dev</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#35774;&#22791;&#21495;  </span>
    <span style="color: #98fb98;">dev_t</span> <span style="color: #eedd82;">st_rdev</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#29305;&#27530;&#35774;&#22791;&#21495;  </span>
    <span style="color: #98fb98;">nlink_t</span> <span style="color: #eedd82;">st_nlink</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#36830;&#25509;&#25968;  </span>
    <span style="color: #98fb98;">uid_t</span> <span style="color: #eedd82;">st_uid</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#25152;&#26377;&#32773;  </span>
    <span style="color: #98fb98;">gid_t</span> <span style="color: #eedd82;">st_gid</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#25152;&#23646;&#32452;  </span>
    <span style="color: #98fb98;">off_t</span> <span style="color: #eedd82;">st_st_size</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#30340;&#23383;&#33410;&#25968;  </span>
    <span style="color: #98fb98;">time_t</span> <span style="color: #eedd82;">st_atime</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#30340;&#26368;&#21518;&#23384;&#21462;&#26102;&#38388;  </span>
    <span style="color: #98fb98;">time_t</span> <span style="color: #eedd82;">mtime</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#30340;&#26368;&#21518;&#20462;&#25913;&#26102;&#38388;  </span>
    <span style="color: #98fb98;">time_t</span> <span style="color: #eedd82;">ctime</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25991;&#20214;&#26435;&#38480;&#30340;&#26368;&#21518;&#20462;&#25913;&#26102;&#38388;  </span>
    <span style="color: #98fb98;">long</span> <span style="color: #eedd82;">st_blksize</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#26368;&#20339;&#30340;IO&#22359;&#38271;&#24230;  </span>
    <span style="color: #98fb98;">long</span> <span style="color: #eedd82;">st_blocks</span>; <span style="color: #ff4500;">//</span><span style="color: #ff4500;">512&#23383;&#33410;&#30340;&#22359;&#25968;  </span>
};
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">文件类型</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>普通文件
</li>
<li>目录
</li>
<li>字符特殊设备：某些类型的设备，终端等
</li>
<li>块特殊设备：磁盘设备
</li>
<li>FIFO管道：进程间的通信
</li>
<li>Socket套接字：主要是进程间的网络通信，也可以是同一台机器不同进程间通信
</li>
<li>符号链接：文件指向另一个文件
</li>
</ol>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">文件类型测试宏</h3>
<div class="outline-text-3" id="text-2-1">
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader　">
<caption class="t-above"><span class="table-number">Table 1:</span> &lt;sys/stat.h&gt;中的文件类型宏</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">宏</td>
<td class="left">文件类型</td>
</tr>

<tr>
<td class="left">S_ISREG()</td>
<td class="left">普通文件</td>
</tr>

<tr>
<td class="left">S_ISDIR()</td>
<td class="left">目录文件</td>
</tr>

<tr>
<td class="left">S_ISCHR()</td>
<td class="left">字符特殊文件</td>
</tr>

<tr>
<td class="left">S_ISBLK()</td>
<td class="left">块特殊文件</td>
</tr>

<tr>
<td class="left">S_ISFIFO()</td>
<td class="left">管道或FIFO</td>
</tr>

<tr>
<td class="left">S_ISLNK()</td>
<td class="left">符号连接</td>
</tr>

<tr>
<td class="left">S_ISSOCK()</td>
<td class="left">套接字</td>
</tr>
</tbody>
</table>

<p>
文件类型信息包含在stat解构的st_mode成员内，以其为参数调用以下宏进行测试，如果返回为真则说明是此种文件类型
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/types.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/stat.h&gt;</span> 
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">"apue.h"</span> 

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">argc</span>, <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">argv</span>[]) 
{
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span>; 
    <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">stat</span> <span style="color: #eedd82;">buf</span>; 
    <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">ptr</span>; 

    <span style="color: #00ffff;">for</span>(i = 1; i &lt; argc; ++i) { 
        printf(<span style="color: #ffa07a;">"%s: "</span>, argv[i]);
        <span style="color: #00ffff;">if</span>(lstat(argv[i], &amp;buf) &lt; 0) {
            err_ret(<span style="color: #ffa07a;">"lstat error"</span>); 
            <span style="color: #00ffff;">continue</span>; 
        }
        <span style="color: #00ffff;">if</span>(S_ISREG(buf.st_mode))
            ptr = <span style="color: #ffa07a;">"regular"</span>; 
        <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span>(S_ISDIR(buf.st_mode)) 
            ptr = <span style="color: #ffa07a;">"directory"</span>; 
        <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span>(S_ISCHR(buf.st_mode)) 
            ptr = <span style="color: #ffa07a;">"character special"</span>; 
        <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span>(S_ISBLK(buf.st_mode)) 
            ptr = <span style="color: #ffa07a;">"block special"</span>; 
        <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span>(S_ISFIFO(buf.st_mode)) 
            ptr = <span style="color: #ffa07a;">"fifo"</span>; 
<span style="color: #7fffd4;">#ifdef</span> S_ISLNK 
        <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span>(S_ISLNK(buf.st_mode)) 
            ptr = <span style="color: #ffa07a;">"symbolic link"</span>; 
<span style="color: #7fffd4;">#endif</span> 
<span style="color: #7fffd4;">#ifdef</span> S_ISSOCK
        <span style="color: #00ffff;">else</span> <span style="color: #00ffff;">if</span>(S_ISSOCK(buf.st_mode)) 
            ptr = <span style="color: #ffa07a;">"socket"</span>; 
<span style="color: #7fffd4;">#endif</span> 
        <span style="color: #00ffff;">else</span> 
            ptr = <span style="color: #ffa07a;">"** unknown mode **"</span>;

        printf(<span style="color: #ffa07a;">"%s\n"</span>, ptr); 
    }

    exit(0);
}
</pre>
</div>

<p>
测试文件类型
</p>
<div class="org-src-container">

<pre class="src src-sh">$ ./filetype ./filetype.c ./filetype.o ./ /dev/sda1 /dev/tty1 /dev/log /dev/fd/0

./filetype.c: regular
./filetype.o: regular
./: directory
/dev/sda1: block special
/dev/tty1: character special
/dev/log: socket
/dev/fd/0: symbolic link
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">文件权限</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">进程相关的用户和组ID</h3>
<div class="outline-text-3" id="text-3-1">
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 2:</span> 与一个进程相关联的用户ID和组ID</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">ID类型</th>
<th scope="col" class="left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">实际用户ID, 实际组ID</td>
<td class="left">我们实际上是谁</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">有效用户ID，有效组ID，添加组ID</td>
<td class="left">用于文件存取许可权检查</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">保存设置-用户-ID，保存-设置-组ID</td>
<td class="left">由exec函数保存</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>实际用户ID和实际组ID这两个字段在登录时取自口令文件中的登录项。通常在一个登录会话期间这些值并不改变，但是超级用户进程有方法改变它们
</li>
<li>有效用户ID，有效组ID以及添加组ID决定了文件访问权
</li>
<li>保存的设置-用户-ID和设置-组-ID在执行一个程序时包含了有效用户ID和有效组ID的副本
</li>
</ul>

<p>
通常有效用户ID等于实际用户ID，有效组ID等于实际组ID
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">设置-用户-ID和设置-组-ID</h3>
<div class="outline-text-3" id="text-3-2">
<p>
每个文件有一个所有者和组所有者。所有者由stat结构中的st_uid表示，组所有者则由st_gid成员表示。 
</p>

<p>
当执行一个程序文件时，进程的有效用户ID通常就是实际用户ID，有效组ID通常是实际组ID。但是可以在st_mode中设置一个特殊标志，其定义是“当执行此文件时，将进程的有效用户ID设置为文件的所有者(st_uid)”。与此相类似，在文件方式字中可以设置另一位,它使得执行此文件的进程的有效组ID设置为文件的组所有者(st_gid)。这两位被称之为设置-用户-ID(set-user-ID)位和设置-组-ID(set-group-ID)位。这两位可用常数S_ISUID和S_ISGID测试
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">文件存取许可权</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Unix对文件定义了三组用户权限，分别对应为属主用户(user)、组用户(group)、其它用户(other)，每组用户各有自己对此文件的读、写、执行权限。权限值以八进制的形式表示,也记录在stat结构的st_mode字段中
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 3:</span> 9个存取许可权位</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">st_mode mask</th>
<th scope="col" class="left">意义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">S_IRUSR</td>
<td class="left">用户读</td>
</tr>

<tr>
<td class="left">S_IWUSR</td>
<td class="left">用户写</td>
</tr>

<tr>
<td class="left">S_IXUSR</td>
<td class="left">用户执行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">S_IRGRP</td>
<td class="left">组读</td>
</tr>

<tr>
<td class="left">S_IWGRP</td>
<td class="left">组写</td>
</tr>

<tr>
<td class="left">S_IXGRP</td>
<td class="left">组执行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">S_IROTH</td>
<td class="left">其他用户读</td>
</tr>

<tr>
<td class="left">S_IWOTH</td>
<td class="left">其他用户写</td>
</tr>

<tr>
<td class="left">S_IXOTH</td>
<td class="left">其他用户执行</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">存取权限规则</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>用名字打开任一类型的文件时，对该名字中包含的每一个目录，包括它可能隐含的当前工作目录都应具有执行许可权。
</li>
<li>对于一个文件的读许可权决定了是否能够打开该文件进行读操作。这对应于open函数的O_RDONLY和O_RDWR标志
</li>
<li>对于一个文件的写许可权决定了我们是否能够打开该文件进行写操作。这对应于open函数的O_WRONLY和O_RDWR标志
</li>
<li>为了在open函数中对一个文件指定O_TRUNC标志，必须对该文件具有写许可权
</li>
<li>为了在一个目录中创建一个新文件，必须对该目录具有写许可权和执行许可权
</li>
<li>为了删除一个文件，必须对包含该文件的目录具有写许可权和执行许可权。对该文件本身则不需要有读、写许可权
</li>
<li>如果用6个exec函数中的任何一个执行某个文件，都必须对该文件具有执行许可权
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">存取权限测试</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
适当的存取许可权位指的是： 
</p>
<ul class="org-ul">
<li>若进程为读而打开该文件，则相应读位应为1
</li>
<li>若进程为写而打开该文件，则相应写位应为1
</li>
<li>若进程将执行该文件，则相应执行位应为1
</li>
</ul>

<p>
进程每次打开、创建或删除一个文件时，内核就进行文件存取许可权测试，而这种测试可能涉及文件的所有者(st_uid和st_gid)，进程的有效ID(有效用户ID和有效组ID)以及进程的添加组ID(若支持的话)。两个所有者ID是文件的性质，而有效ID和添加组ID则是进程的性质。内核进行的测试是:
</p>
<ol class="org-ol">
<li>若进程的有效用户ID是0(超级用户)，则允许存取。这给予了超级用户对文件系统进行处理的最充分的自由
</li>
<li>若进程的有效用户ID等于文件的所有者ID(也就是该进程拥有此文件):
<ul class="org-ul">
<li>若适当的所有者存取许可权位被设置，则允许存取
</li>
<li>否则拒绝存取 
</li>
</ul>
</li>
<li>若进程的有效组ID或进程的添加组ID之一等于文件的组ID:
<ul class="org-ul">
<li>若适当的组存取许可权位被设置，则允许存取
</li>
<li>否则拒绝存取 
</li>
</ul>
</li>
<li>若适当的其他用户存取许可权位被设置，则允许存取，否则拒绝存取
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3">新文件和目录的所有权</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
创建新文件和目录的用户ID被设置为进程的有效用户ID
</p>

<p>
关于组ID，POSIX.1允许选择下列之一作为新文件和目录的组ID： 
</p>
<ol class="org-ol">
<li>新文件的组ID可以是进程的有效组ID
</li>
<li>新文件的组ID可以是它所在目录的组ID
</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
    <div class='ds-thread'></div>
<script>
var duoshuoQuery = {short_name:'klose911'};
(function() {
	 var dsThread = document.getElementsByClassName('ds-thread')[0];
         dsThread.setAttribute('data-thread-key', document.title);
         dsThread.setAttribute('data-title', document.title);
         dsThread.setAttribute('data-url', window.location.href);
	 var ds = document.createElement('script');
	 ds.type = 'text/javascript';ds.async = true;
	 ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	 ds.charset = 'UTF-8';
	 (document.getElementsByTagName('head')[0] 
				       || document.getElementsByTagName('body')[0]).appendChild(ds);
				       })();
</script>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
